lucckb/isixrtos/libstm32/inc/stm32tim.h
}
/* ---------------------------------------------------------------------------- */
//Enable CTRL advanced output only on advanced timers like TIM1
static inline void tim_ctrl_pwm_outputs( TIM_TypeDef* TIMx, int enable )
{
	/* Check the parameters */
	if ( enable )
	{
	    /* Enable the TIM Main Output */
	    TIMx->BDTR |= TIM_BDTR_MOE;
	}
	else
	{
	    /* Disable the TIM Main Output */
	    TIMx->BDTR &= (uint16_t)(~((uint16_t)TIM_BDTR_MOE));
	}
}
/* ---------------------------------------------------------------------------- */
//Enable or disable timer
static inline void tim_cmd(TIM_TypeDef* TIMx, int enable )
{

	  if ( enable )
	  {
	    /* Enable the TIM Counter */
	    TIMx->CR1 |= TIM_CR1_CEN;
	  }
	  else
	  {
	    /* Disable the TIM Counter */
	    TIMx->CR1 &= (uint16_t)(~((uint16_t)TIM_CR1_CEN));
	  }
}
/* ---------------------------------------------------------------------------- */
//Configure BDTR register
static inline void tim_bdtr_config(TIM_TypeDef* TIMx, uint8_t dead_time, uint16_t config)
{
	TIMx->BDTR = (uint16_t)dead_time | config;
}
//Preload enable timer CCR will be updated only on new cycle
/* ---------------------------------------------------------------------------- */
//Set compare capture reg
static inline void tim_oc_preload_config(TIM_TypeDef* TIMx, enum tim_cc_chns chn, int enabled)
{
	switch( chn )
	{
		case tim_cc_chn1:
			if(enabled) TIMx->CCMR1 |= TIM_CCMR1_OC1PE;
			else TIMx->CCMR1 &= ~TIM_CCMR1_OC1PE;
			break;
		case tim_cc_chn2:
			if(enabled) TIMx->CCMR1 |= TIM_CCMR1_OC2PE;
			else TIMx->CCMR1 &= ~TIM_CCMR1_OC2PE;
			break;
		case tim_cc_chn3:
			if(enabled) TIMx->CCMR2 |= TIM_CCMR2_OC3PE;
			else TIMx->CCMR2 &= ~TIM_CCMR2_OC3PE;
			break;
		case tim_cc_chn4:
			if(enabled) TIMx->CCMR2 |= TIM_CCMR2_OC4PE;
			else TIMx->CCMR2 &= ~TIM_CCMR2_OC4PE;
			break;
	}

}
/* ---------------------------------------------------------------------------- */
/** Enable or disable ARR shadow register in the time base,
 * required only if the time base will be changed
 */
static inline void tim_arr_preload_enable(TIM_TypeDef* TIMx, int enable)
{
	/* Check the parameters */
	  if (enable)
	  {
	    /* Set the ARR Preload Bit */
	    TIMx->CR1 |= TIM_CR1_ARPE;
	  }
	  else
	  {
	    /* Reset the ARR Preload Bit */
	    TIMx->CR1 &= (uint16_t)~((uint16_t)TIM_CR1_ARPE);
	  }
}
/* ---------------------------------------------------------------------------- */
//Internal used by ic_init
#ifdef __cplusplus
namespace _internal {
namespace tim {
/* ---------------------------------------------------------------------------- */
static const uint16_t  SMCR_ETR_Mask      =       0x00FF;
static const uint16_t  CCER_CCE_Set       =       0x0001;
static const uint16_t  CCER_CCNE_Set      =       0x0004;
static const uint16_t  CCMR_Offset        =       0x0018;
/* ---------------------------------------------------------------------------- */
static inline void TI1_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{
  uint16_t tmpccmr1 = 0, tmpccer = 0;
  /* Disable the Channel 1: Reset the CC1E Bit */
  TIMx->CCER &= (uint16_t)~((uint16_t)TIM_CCER_CC1E);
  tmpccmr1 = TIMx->CCMR1;
  tmpccer = TIMx->CCER;
  /* Select the Input and set the filter */
  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)TIM_CCMR1_CC1S)) & ((uint16_t)~((uint16_t)TIM_CCMR1_IC1F)));
  tmpccmr1 |= (uint16_t)(TIM_ICSelection | (uint16_t)(TIM_ICFilter << (uint16_t)4));

  if((TIMx == TIM1) || (TIMx == TIM8) || (TIMx == TIM2) || (TIMx == TIM3) ||
     (TIMx == TIM4) ||(TIMx == TIM5))
  {
    /* Select the Polarity and set the CC1E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TIM_CCER_CC1P));
    tmpccer |= (uint16_t)(TIM_ICPolarity | (uint16_t)TIM_CCER_CC1E);
  }
  else
  {
    /* Select the Polarity and set the CC1E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TIM_CCER_CC1P | TIM_CCER_CC1NP));
    tmpccer |= (uint16_t)(TIM_ICPolarity | (uint16_t)TIM_CCER_CC1E);
  }

  /* Write to TIMx CCMR1 and CCER registers */
  TIMx->CCMR1 = tmpccmr1;
  TIMx->CCER = tmpccer;
}

/* ---------------------------------------------------------------------------- */
static inline void TIM_SetIC1Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{
  /* Reset the IC1PSC Bits */
  TIMx->CCMR1 &= (uint16_t)~((uint16_t)TIM_CCMR1_IC1PSC);
  /* Set the IC1PSC value */
  TIMx->CCMR1 |= TIM_ICPSC;
}
/* ---------------------------------------------------------------------------- */
static inline void TI2_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{
  uint16_t tmpccmr1 = 0, tmpccer = 0, tmp = 0;
  /* Disable the Channel 2: Reset the CC2E Bit */
  TIMx->CCER &= (uint16_t)~((uint16_t)TIM_CCER_CC2E);
  tmpccmr1 = TIMx->CCMR1;
  tmpccer = TIMx->CCER;
  tmp = (uint16_t)(TIM_ICPolarity << 4);
  /* Select the Input and set the filter */
  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)TIM_CCMR1_CC2S)) & ((uint16_t)~((uint16_t)TIM_CCMR1_IC2F)));
  tmpccmr1 |= (uint16_t)(TIM_ICFilter << 12);
  tmpccmr1 |= (uint16_t)(TIM_ICSelection << 8);

  if((TIMx == TIM1) || (TIMx == TIM8) || (TIMx == TIM2) || (TIMx == TIM3) ||
     (TIMx == TIM4) ||(TIMx == TIM5))
  {
    /* Select the Polarity and set the CC2E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TIM_CCER_CC2P));
    tmpccer |=  (uint16_t)(tmp | (uint16_t)TIM_CCER_CC2E);
  }
  else
  {
    /* Select the Polarity and set the CC2E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TIM_CCER_CC2P | TIM_CCER_CC2NP));
    tmpccer |= (uint16_t)(TIM_ICPolarity | (uint16_t)TIM_CCER_CC2E);
  }

  /* Write to TIMx CCMR1 and CCER registers */
  TIMx->CCMR1 = tmpccmr1 ;
  TIMx->CCER = tmpccer;
}
/* ---------------------------------------------------------------------------- */
static inline void TIM_SetIC2Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{
  /* Reset the IC2PSC Bits */
  TIMx->CCMR1 &= (uint16_t)~((uint16_t)TIM_CCMR1_IC2PSC);
  /* Set the IC2PSC value */
  TIMx->CCMR1 |= (uint16_t)(TIM_ICPSC << 8);
}
/* ---------------------------------------------------------------------------- */
static inline void TI3_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{
  uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;
  /* Disable the Channel 3: Reset the CC3E Bit */
  TIMx->CCER &= (uint16_t)~((uint16_t)TIM_CCER_CC3E);
  tmpccmr2 = TIMx->CCMR2;
  tmpccer = TIMx->CCER;
  tmp = (uint16_t)(TIM_ICPolarity << 8);
  /* Select the Input and set the filter */
  tmpccmr2 &= (uint16_t)(((uint16_t)~((uint16_t)TIM_CCMR2_CC3S)) & ((uint16_t)~((uint16_t)TIM_CCMR2_IC3F)));
  tmpccmr2 |= (uint16_t)(TIM_ICSelection | (uint16_t)(TIM_ICFilter << (uint16_t)4));

