lucckb/isixrtos/libstm32/inc/stm32tim.h
  /* Select the Capture Compare 1 and the Capture Compare 2 as input */
  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)TIM_CCMR1_CC1S)) & (uint16_t)(~((uint16_t)TIM_CCMR1_CC2S)));
  tmpccmr1 |= TIM_CCMR1_CC1S_0 | TIM_CCMR1_CC2S_0;

  /* Set the TI1 and the TI2 Polarities */
  tmpccer &= (uint16_t)(((uint16_t)~((uint16_t)TIM_CCER_CC1P)) & ((uint16_t)~((uint16_t)TIM_CCER_CC2P)));
  tmpccer |= (uint16_t)(TIM_IC1Polarity | (uint16_t)(TIM_IC2Polarity << (uint16_t)4));

  /* Write to TIMx SMCR */
  TIMx->SMCR = tmpsmcr;
  /* Write to TIMx CCMR1 */
  TIMx->CCMR1 = tmpccmr1;
  /* Write to TIMx CCER */
  TIMx->CCER = tmpccer;
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Forces the TIMx output 1 waveform to active or inactive level.
  * @param  TIMx: where x can be  1 to 17 except 6 and 7 to select the TIM peripheral.
  * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg TIM_ForcedAction_Active: Force active level on OC1REF
  *     @arg TIM_ForcedAction_InActive: Force inactive level on OC1REF.
  * @retval None
  */
static inline void tim_forced_oc_config(TIM_TypeDef* TIMx, enum tim_cc_chns chn,uint16_t TIM_ForcedAction)
{
#ifdef __cplusplus
	using namespace _internal::tim;
#endif
	switch( chn )
	{
		case tim_cc_chn1:	ForcedOC1Config( TIMx, TIM_ForcedAction ); break;
		case tim_cc_chn2:	ForcedOC2Config( TIMx, TIM_ForcedAction ); break;
		case tim_cc_chn3:	ForcedOC3Config( TIMx, TIM_ForcedAction ); break;
		case tim_cc_chn4:	ForcedOC4Config( TIMx, TIM_ForcedAction ); break;
	}
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Enables or disables TIMx peripheral Preload register on ARR.
  * @param  TIMx: where x can be  1 to 17 to select the TIM peripheral.
  * @param  NewState: new state of the TIMx peripheral Preload register
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void tim_arrp_reload_config(TIM_TypeDef* TIMx, bool enable)
{
  if (enable)
  {
    /* Set the ARR Preload Bit */
    TIMx->CR1 |= TIM_CR1_ARPE;
  }
  else
  {
    /* Reset the ARR Preload Bit */
    TIMx->CR1 &= (uint16_t)~((uint16_t)TIM_CR1_ARPE);
  }
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Selects the TIM peripheral Commutation event.
  * @param  TIMx: where x can be  1, 8, 15, 16 or 17 to select the TIMx peripheral
  * @param  NewState: new state of the Commutation event.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void tim_select_com(TIM_TypeDef* TIMx, bool enable)
{
  if (enable)
  {
    /* Set the COM Bit */
    TIMx->CR2 |= TIM_CR2_CCUS;
  }
  else
  {
    /* Reset the COM Bit */
    TIMx->CR2 &= (uint16_t)~((uint16_t)TIM_CR2_CCUS);
  }
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Selects the TIMx peripheral Capture Compare DMA source.
  * @param  TIMx: where x can be  1, 2, 3, 4, 5, 8, 15, 16 or 17 to select
  *         the TIM peripheral.
  * @param  NewState: new state of the Capture Compare DMA source
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void tim_select_ccdma(TIM_TypeDef* TIMx, bool enable)
{
  if ( enable )
  {
    /* Set the CCDS Bit */
    TIMx->CR2 |= TIM_CR2_CCDS;
  }
  else
  {
    /* Reset the CCDS Bit */
    TIMx->CR2 &= (uint16_t)~((uint16_t)TIM_CR2_CCDS);
  }
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Sets or Resets the TIM peripheral Capture Compare Preload Control bit.
  * @param  TIMx: where x can be   1, 2, 3, 4, 5, 8 or 15
  *         to select the TIMx peripheral
  * @param  NewState: new state of the Capture Compare Preload Control bit
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
static inline void tim_cc_preload_control(TIM_TypeDef* TIMx, bool enable)
{
  if ( enable )
  {
    /* Set the CCPC Bit */
    TIMx->CR2 |= TIM_CR2_CCPC;
  }
  else
  {
    /* Reset the CCPC Bit */
    TIMx->CR2 &= (uint16_t)~((uint16_t)TIM_CR2_CCPC);
  }
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Configures the TIMx Output Compare 1 Fast feature.
  * @param  TIMx: where x can be  1 to 17 except 6 and 7 to select the TIM peripheral.
  * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TIM_OCFast_Enable: TIM output compare fast enable
  *     @arg TIM_OCFast_Disable: TIM output compare fast disable
  * @retval None
  */
static inline void tim_oc_fast_config(TIM_TypeDef* TIMx, enum tim_cc_chns chn, uint16_t TIM_OCFast)
{
#ifdef __cplusplus
	using namespace _internal::tim;
#endif
	switch( chn )
	{
		case tim_cc_chn1:	OC1FastConfig( TIMx, TIM_OCFast ); break;
		case tim_cc_chn2:	OC2FastConfig( TIMx, TIM_OCFast ); break;
		case tim_cc_chn3:	OC3FastConfig( TIMx, TIM_OCFast ); break;
		case tim_cc_chn4:	OC4FastConfig( TIMx, TIM_OCFast ); break;
	}
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Clears or safeguards the OCREF1 signal on an external event
  * @param  TIMx: where x can be  1, 2, 3, 4, 5 or 8 to select the TIM peripheral.
  * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TIM_OCClear_Enable: TIM Output clear enable
  *     @arg TIM_OCClear_Disable: TIM Output clear disable
  * @retval None
  */
static inline void tim_clear_oc_ref(TIM_TypeDef* TIMx, enum tim_cc_chns chn, uint16_t TIM_OCClear)
{
#ifdef __cplusplus
	using namespace _internal::tim;
#endif
	switch( chn )
	{
		case tim_cc_chn1:	ClearOC1Ref( TIMx, TIM_OCClear ); break;
		case tim_cc_chn2:	ClearOC2Ref( TIMx, TIM_OCClear ); break;
		case tim_cc_chn3:	ClearOC3Ref( TIMx, TIM_OCClear ); break;
		case tim_cc_chn4:	ClearOC4Ref( TIMx, TIM_OCClear ); break;
	}
}
/* ---------------------------------------------------------------------------- */
/* @brief  Configures the TIMx channel x polarity.
* @param  TIMx: where x can be 1 to 17 except 6 and 7 to select the TIM peripheral.
* @param  TIM_OCPolarity: specifies the OC1 Polarity
*   This parameter can be one of the following values:
*     @arg TIM_OCPolarity_High: Output Compare active high
*     @arg TIM_OCPolarity_Low: Output Compare active low
* @retval None
*/
static inline void tim_oc_polarity_config(TIM_TypeDef* TIMx,enum tim_cc_chns chn, uint16_t TIM_OCPolarity)
{
#ifdef __cplusplus
	using namespace _internal::tim;
#endif
	switch( chn )
	{
		case tim_cc_chn1:	OC1PolarityConfig( TIMx, TIM_OCPolarity ); break;
		case tim_cc_chn2:	OC2PolarityConfig( TIMx, TIM_OCPolarity ); break;
		case tim_cc_chn3:	OC3PolarityConfig( TIMx, TIM_OCPolarity ); break;
		case tim_cc_chn4:	OC4PolarityConfig( TIMx, TIM_OCPolarity ); break;
	}
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Configures the TIMx Channel 1N polarity.
  * @param  TIMx: where x can be 1, 8, 15, 16 or 17 to select the TIM peripheral.
  * @param  TIM_OCNPolarity: specifies the OC1N Polarity
  *   This parameter can be one of the following values:
  *     @arg TIM_OCNPolarity_High: Output Compare active high
  *     @arg TIM_OCNPolarity_Low: Output Compare active low
  * @retval None
  */
static inline void tim_ocn_polarity_config(TIM_TypeDef* TIMx, enum tim_cc_chns chn, uint16_t TIM_OCNPolarity)
{
#ifdef __cplusplus
	using namespace _internal::tim;
#endif
	switch( chn )
	{
		case tim_cc_chn1:	OC1NPolarityConfig( TIMx, TIM_OCNPolarity ); break;
		case tim_cc_chn2:	OC2NPolarityConfig( TIMx, TIM_OCNPolarity ); break;
		case tim_cc_chn3:	OC3NPolarityConfig( TIMx, TIM_OCNPolarity ); break;
		case tim_cc_chn4:	break;
	}
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Enables or disables the TIM Capture Compare Channel x.
  * @param  TIMx: where x can be 1 to 17 except 6 and 7 to select the TIM peripheral.
  * @param  TIM_Channel: specifies the TIM Channel
  *   This parameter can be one of the following values:
  *     @arg TIM_Channel_1: TIM Channel 1
  *     @arg TIM_Channel_2: TIM Channel 2
  *     @arg TIM_Channel_3: TIM Channel 3
  *     @arg TIM_Channel_4: TIM Channel 4
  * @param  TIM_CCx: specifies the TIM Channel CCxE bit new state.
  *   This parameter can be: TIM_CCx_Enable or TIM_CCx_Disable.
  * @retval None
  */
static inline void tim_ccx_cmd(TIM_TypeDef* TIMx, enum tim_cc_chns chn, uint16_t TIM_CCx)
{
#ifdef __cplusplus
	using namespace _internal::tim;
#endif
  uint16_t tmp;
  uint16_t TIM_Channel;
  switch( chn )
  {
  		case tim_cc_chn1:	TIM_Channel = TIM_Channel_1; break;
  		case tim_cc_chn2:	TIM_Channel = TIM_Channel_2; break;
  		case tim_cc_chn3:	TIM_Channel = TIM_Channel_3; break;
  		case tim_cc_chn4:	TIM_Channel = TIM_Channel_4; break;
  }
  tmp = CCER_CCE_Set << TIM_Channel;

  /* Reset the CCxE Bit */
  TIMx->CCER &= (uint16_t)~ tmp;

  /* Set or reset the CCxE Bit */
  TIMx->CCER |=  (uint16_t)(TIM_CCx << TIM_Channel);
}
/* ---------------------------------------------------------------------------- */
/**
  * @brief  Enables or disables the TIM Capture Compare Channel xN.
  * @param  TIMx: where x can be 1, 8, 15, 16 or 17 to select the TIM peripheral.
  * @param  TIM_Channel: specifies the TIM Channel
  *   This parameter can be one of the following values:
  *     @arg TIM_Channel_1: TIM Channel 1
  *     @arg TIM_Channel_2: TIM Channel 2
  *     @arg TIM_Channel_3: TIM Channel 3
  * @param  TIM_CCxN: specifies the TIM Channel CCxNE bit new state.
  *   This parameter can be: TIM_CCxN_Enable or TIM_CCxN_Disable.
  * @retval None
  */
static inline void tim_ccx_n_cmd(TIM_TypeDef* TIMx, enum tim_cc_chns chn, uint16_t TIM_CCxN)
{
#ifdef __cplusplus
	using namespace _internal::tim;
#endif
  uint16_t tmp = 0;
  uint16_t TIM_Channel;
   switch( chn )
   {
    	case tim_cc_chn1:	TIM_Channel = TIM_Channel_1; break;
    	case tim_cc_chn2:	TIM_Channel = TIM_Channel_2; break;
    	case tim_cc_chn3:	TIM_Channel = TIM_Channel_3; break;
    	case tim_cc_chn4:	break;
   }
  tmp = CCER_CCNE_Set << TIM_Channel;

  /* Reset the CCxNE Bit */
  TIMx->CCER &= (uint16_t) ~tmp;

  /* Set or reset the CCxNE Bit */
  TIMx->CCER |=  (uint16_t)(TIM_CCxN << TIM_Channel);
}
/* ---------------------------------------------------------------------------- */

/**
  * @brief  Selects the TIM Output Compare Mode.
  * @note   This function disables the selected channel before changing the Output
  *         Compare Mode.
  *         User has to enable this channel using TIM_CCxCmd and TIM_CCxNCmd functions.
  * @param  TIMx: where x can be 1 to 17 except 6 and 7 to select the TIM peripheral.
  * @param  TIM_Channel: specifies the TIM Channel
  *   This parameter can be one of the following values:
  *     @arg TIM_Channel_1: TIM Channel 1
  *     @arg TIM_Channel_2: TIM Channel 2
  *     @arg TIM_Channel_3: TIM Channel 3
  *     @arg TIM_Channel_4: TIM Channel 4
  * @param  TIM_OCMode: specifies the TIM Output Compare Mode.
  *   This parameter can be one of the following values:
  *     @arg TIM_OCMode_Timing
  *     @arg TIM_OCMode_Active
  *     @arg TIM_OCMode_Toggle
  *     @arg TIM_OCMode_PWM1
  *     @arg TIM_OCMode_PWM2
  *     @arg TIM_ForcedAction_Active
  *     @arg TIM_ForcedAction_InActive
  * @retval None
  */
static inline void tim_select_ocxm(TIM_TypeDef* TIMx,enum tim_cc_chns chn, uint16_t TIM_OCMode)
{
#ifdef __cplusplus
	using namespace _internal::tim;
#endif
  uint16_t TIM_Channel;
  uint32_t tmp = 0;
  uint16_t tmp1 = 0;
  switch( chn )
  {
    		case tim_cc_chn1:	TIM_Channel = TIM_Channel_1; break;
    		case tim_cc_chn2:	TIM_Channel = TIM_Channel_2; break;
    		case tim_cc_chn3:	TIM_Channel = TIM_Channel_3; break;
    		case tim_cc_chn4:	TIM_Channel = TIM_Channel_4; break;
   }
  tmp = (uint32_t) TIMx;
  tmp += CCMR_Offset;

  tmp1 = CCER_CCE_Set << (uint16_t)TIM_Channel;

  /* Disable the Channel: Reset the CCxE Bit */
  TIMx->CCER &= (uint16_t) ~tmp1;

  if((TIM_Channel == TIM_Channel_1) ||(TIM_Channel == TIM_Channel_3))
  {
    tmp += (TIM_Channel>>1);

    /* Reset the OCxM bits in the CCMRx register */
    *(__IO uint32_t *) tmp &= (uint32_t)~((uint32_t)TIM_CCMR1_OC1M);

